recipes/cherry-clafoutis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cherry clafoutis</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/css/org.css" /> <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.1/css/brands.min.css">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/recipes/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Cherry clafoutis</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org27b3b57">Cherry clafoutis</a>
<ul>
<li><a href="#org7d83080">Ingredients</a></li>
<li><a href="#org27f0d14">Instructions</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org27b3b57" class="outline-2">
<h2 id="org27b3b57">Cherry clafoutis</h2>
<div class="outline-text-2" id="text-org27b3b57">
</div>
<div id="outline-container-org7d83080" class="outline-3">
<h3 id="org7d83080">Ingredients</h3>
<div class="outline-text-3" id="text-org7d83080">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Ingredient</th>
<th scope="col" class="org-left">Quantity</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Cherries</td>
<td class="org-left">500g</td>
</tr>

<tr>
<td class="org-left">Butter</td>
<td class="org-left">60g</td>
</tr>

<tr>
<td class="org-left">Eggs</td>
<td class="org-left">4</td>
</tr>

<tr>
<td class="org-left">Milk</td>
<td class="org-left">25cl</td>
</tr>

<tr>
<td class="org-left">Flour</td>
<td class="org-left">100g</td>
</tr>

<tr>
<td class="org-left">Sugar</td>
<td class="org-left">125g</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org27f0d14" class="outline-3">
<h3 id="org27f0d14">Instructions</h3>
<div class="outline-text-3" id="text-org27f0d14">
<ul class="org-ul">
<li>Pre-heat oven at 200°C</li>
<li>Melt the butter</li>
<li>In a large bowl:
<ul class="org-ul">
<li>Scramble the eggs, add the sugar and keep scrambling until white-ish</li>
<li>Add the flour, the butter, the milk and mix until smooth</li>
</ul></li>
<li>Rinse the cherries and dry</li>
<li>Butter a pie dish</li>
<li>Add a thin (5mm) layer of batter at the bottom of the pie dish and bake for 5min</li>
<li>Add the cherries and the rest of the batter</li>
<li>Bake for 30-40min (a knife inserted in the middle of the pie should come out clean)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-05-09 Mon 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
</div>
</body>
</html>
